---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.Language
source: html/2b1d8b80-a11c-2a57-63bd-6c0d67691879.htm
---
# Autodesk.Revit.ApplicationServices.Application.Language Property

The language used in the current session of Revit.

## Syntax (C#)
```csharp
public LanguageType Language { get; }
```

## Remarks
Use this property to determine the language used by Revit; this can allow your application to load the appropriate resources.